shanjiancaofu/smart-gas-monitor/stm32f103/bsp/bsp_key.c
#include "bsp_key.h"
#include "main.h"
#include "stm32f1xx_hal.h"
#include <stdbool.h>
#include <string.h>

#if !defined(__ARMCC_VERSION)
_Static_assert(KEY1_Pin != KEY2_Pin && KEY1_Pin != KEY3_Pin && KEY1_Pin != KEY4_Pin &&
                   KEY1_Pin != KEY5_Pin && KEY2_Pin != KEY3_Pin && KEY2_Pin != KEY4_Pin &&
                   KEY2_Pin != KEY5_Pin && KEY3_Pin != KEY4_Pin && KEY3_Pin != KEY5_Pin &&
                   KEY4_Pin != KEY5_Pin,
               "every key needs its own pin: EXTI lines are shared by pin number");
#endif

typedef struct {
    GPIO_TypeDef *port;
    uint16_t pin;
} bsp_key_slot_t;

static const bsp_key_slot_t bsp_key_slots[KEY_COUNT] = {
    {KEY1_GPIO_Port, KEY1_Pin}, {KEY2_GPIO_Port, KEY2_Pin}, {KEY3_GPIO_Port, KEY3_Pin},
    {KEY4_GPIO_Port, KEY4_Pin}, {KEY5_GPIO_Port, KEY5_Pin},
};

static volatile uint8_t exti_pending;

static uint8_t bsp_key_bits(void)
{
    uint8_t bits = 0u;
    unsigned i;

    for (i = 0; i < KEY_COUNT; ++i) {
        if (HAL_GPIO_ReadPin(bsp_key_slots[i].port, bsp_key_slots[i].pin) == GPIO_PIN_RESET) {
            bits |= (uint8_t)(1u << i);
        }
    }
    return bits;
}

void bsp_key_init(bsp_key_t *keys)
{
    memset(keys, 0, sizeof(*keys));
    keys->held = bsp_key_bits();
    exti_pending = 0;
}


void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    unsigned i;

    for (i = 0; i < KEY_COUNT; ++i) {
        if (GPIO_Pin == bsp_key_slots[i].pin) {
            exti_pending |= (uint8_t)(1u << i);
        }
    }
}

static uint8_t bsp_key_take_edges(void)
{
    uint32_t primask = __get_PRIMASK();
    uint8_t edges;

    __disable_irq();
    edges = exti_pending;
    exti_pending = 0;
    __set_PRIMASK(primask);
    return edges;
}

uint8_t bsp_key_poll(bsp_key_t *keys, uint32_t now)
{
    uint8_t edges = bsp_key_take_edges();
    uint8_t events = 0u;
    uint8_t current = bsp_key_bits();
    unsigned i;

    /* Proteus may not model every STM32 EXTI edge reliably. Keep EXTI as the
       primary path, and merge a polled high-to-low transition as a fallback.
       On hardware, OR-ing the same edge cannot create a duplicate event. */
    edges |= (uint8_t)(current & (uint8_t)~keys->held);
    keys->held = current;
    for (i = 0; i < KEY_COUNT; ++i) {
        uint8_t mask = (uint8_t)(1u << i);

        /* 涓嬮檷娌跨敱 EXTI 璁板湪涓柇閲岋紝涓诲惊鐜粈涔堟椂鍊欏洖鏉ュ鐞嗛兘绠楁暟鈥斺€旇蒋浠?I2C
         * 涓€娆℃暣灞忓埛鏂颁細闃诲鍑犵櫨姣锛岃疆璇㈠湪杩欐鏃堕棿閲屽畬鍏ㄧ湅涓嶅埌鎸夐敭锛岀煭鎸?         * 浼氭暣娈典涪鎺夈€?*/
        if (edges & mask) {
            keys->edge_ms[i] = now;
            keys->pending |= mask;
        }
        /* 娑堟姈绐楀彛璧板畬鎵嶅彂浜嬩欢锛涚獥鍙ｉ噷鍙堟潵浜嗘柊鐨勪笅闄嶆部灏遍『寤讹紝鎶栧姩涓嶄細杩炲彂銆?*/
        if ((keys->pending & mask) != 0u &&
            (uint32_t)(now - keys->edge_ms[i]) >= KEY_DEBOUNCE_MS) {
            keys->pending &= (uint8_t)~mask;
            events |= mask;
        }
    }
    return events;
}
